In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [4]:
csv_file = "employed_vs_unemployed_by_age.csv"
customer_data_df = pd.read_csv(csv_file)
customer_data_df.head()

,Age,Unemployed Males,Unemployed Females,Unemployed Persons,Employed Males,Employed Females,Employed Persons
0,15–24,159.565385,121.044091,280.609476,380.401490,385.679059,766.080549
1,25–34,74.594166,66.539344,141.133510,367.450979,351.866669,719.317648
2,35–44,51.645724,50.073316,101.719040,241.445846,210.000568,451.446414
3,45–54,44.478867,47.368897,91.847764,142.725985,137.576324,280.302310
4,55–64,43.499937,35.048634,78.548571,87.621948,80.653175,168.275124

### Connect to local database

In [19]:
rds_connection_string = "postgres:postgres>@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [5]:
engine.table_names()

NameError: name 'engine' is not defined

### Use pandas to load csv converted DataFrame into database

In [8]:
new_customer_data_df.to_sql(name='customer_name', con=engine, if_exists='append', index=False)

### Use pandas to load json converted DataFrame into database

In [9]:
new_customer_location_df.to_sql(name='customer_location', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [10]:
pd.read_sql_query('select * from customer_name', con=engine).head()

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

### Confirm data has been added by querying the customer_location table

In [11]:
pd.read_sql_query('select * from customer_location', con=engine).head()

   id                address  us_state
0   1  043 Mockingbird Place   Indiana
1   2       4 Prentice Point   Indiana
2   3      46 Derek Junction     Texas
3   4  11966 Old Shore Place  Missouri
4   5     5 Evergreen Circle  New York